10101kin/CodeArch-Tracing/codegen_outputs/Migrate_iLLD_TC387_ADS_QSPI_TLE9180D_2_to_iLLD_TC4_r_20260323_101004/attempt_002_mock/IfxCpu_Irq.c
#include "IfxCpu_Irq.h"

static uint32 s_installInterruptHandler_count = 0;
static uint32 s_installInterruptHandler_lastPrio = 0U;
static void  *s_installInterruptHandler_lastIsrPtr = NULL_PTR;

void IfxCpu_Irq_installInterruptHandler(void *isrFuncPointer, uint32 serviceReqPrioNumber)
{
    s_installInterruptHandler_count++;
    s_installInterruptHandler_lastIsrPtr = isrFuncPointer;
    s_installInterruptHandler_lastPrio   = serviceReqPrioNumber;
}

uint32 IfxCpu_Irq_Mock_GetCallCount_installInterruptHandler(void)
{
    return s_installInterruptHandler_count;
}

uint32 IfxCpu_Irq_Mock_GetLastArg_installInterruptHandler_serviceReqPrioNumber(void)
{
    return s_installInterruptHandler_lastPrio;
}

void* IfxCpu_Irq_Mock_GetLastArg_installInterruptHandler_isrFuncPointer(void)
{
    return s_installInterruptHandler_lastIsrPtr;
}

void IfxCpu_Irq_Mock_Reset(void)
{
    s_installInterruptHandler_count = 0U;
    s_installInterruptHandler_lastPrio = 0U;
    s_installInterruptHandler_lastIsrPtr = NULL_PTR;
}
